# VertexFormat Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexFormat Class
Members See Also
---
A specification of the format of vertex data contained in a piece of geometry.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class VertexFormat : IDisposable
```

Visual Basic
---
```text
Public Class VertexFormat _
	Implements IDisposable
```

Visual C++
---
```text
public ref class VertexFormat : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..VertexFormat
# See Also
VertexFormat Members
Autodesk.Revit.DB.DirectContext3D Namespace